### Pandas-DataFrame And Series

Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-diamensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labled axes(rows and columns).

In [1]:
import pandas as pd

In [3]:
## Series
## A pandas Series is a one-diamensional array-like object that can hold any data type. It is similar to a column in a table.

import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
## Create a Series from a dictionary
data={'a':1,"b":2,"c":3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [5]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [7]:
## Dataframe
## Create a Dataframe from a dictionary of list

data={
    'Name':['Mukul','John','Jack'],
    'Age':[25,30,45],
    'City':['New York','London','Bristol']
}

df=pd.DataFrame(data)
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
    Name  Age      City
0  Mukul   25  New York
1   John   30    London
2   Jack   45   Bristol

In [14]:
## Create a Dataframe from a list of dictionaries
data=[
    {"Name":"A","Age":32,"City":"London"},
    {"Name":"B","Age":22,"City":"Bristol"},
    {"Name":"C","Age":43,"City":"New York"},
    {"Name":"D","Age":24,"City":"Manchester"}
]

df=pd.DataFrame(data)
print(df)
print(type(df))

  Name  Age        City
0    A   32      London
1    B   22     Bristol
2    C   43    New York
3    D   24  Manchester
<class 'pandas.core.frame.DataFrame'>

In [52]:
df=pd.read_csv('Orders.csv')
df.head(5)

  Order ID  Order Date CustomerName           State     City
0  B-26055  10-03-2018    Harivansh   Uttar Pradesh  Mathura
1  B-25993  03-02-2018       Madhav           Delhi    Delhi
2  B-25973  24-01-2018  Madan Mohan   Uttar Pradesh  Mathura
3  B-25923  27-12-2018        Gopal     Maharashtra   Mumbai
4  B-25757  21-08-2018     Vishakha  Madhya Pradesh   Indore

In [11]:
df.tail(5)

    Order ID  Order Date CustomerName             State     City
495  B-25742  03-08-2018       Ashwin               Goa      Goa
496  B-26088  26-03-2018       Bhavna            Sikkim  Gangtok
497  B-25707  01-07-2018      Shivani       Maharashtra   Mumbai
498  B-25758  22-08-2018      Shubham  Himachal Pradesh    Simla
499  B-26095  28-03-2018      Monisha         Rajasthan   Jaipur

In [15]:
### Accessing data from dataframe
df

  Name  Age        City
0    A   32      London
1    B   22     Bristol
2    C   43    New York
3    D   24  Manchester

In [18]:
df['Name']

0    A
1    B
2    C
3    D
Name: Name, dtype: object

In [21]:
df.loc[0][0]

C:\Users\Mukul\AppData\Local\Temp\ipykernel_15740\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'A'

In [26]:
df.iloc[0][2]

C:\Users\Mukul\AppData\Local\Temp\ipykernel_15740\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'London'

In [29]:
df

  Name  Age        City
0    A   32      London
1    B   22     Bristol
2    C   43    New York
3    D   24  Manchester

In [31]:
## Accessing a specific element
df.at[1,'Age']

np.int64(22)

In [32]:
df.at[1,"Name"]

'B'

In [33]:
## Accessing a specified element using iat
df.iat[2,2]

'New York'

In [34]:
df

  Name  Age        City
0    A   32      London
1    B   22     Bristol
2    C   43    New York
3    D   24  Manchester

In [35]:
### Data Manipulation with DataFrames
df

  Name  Age        City
0    A   32      London
1    B   22     Bristol
2    C   43    New York
3    D   24  Manchester

In [44]:
df['Salary']=[6000,5000,4500,6500]
df

  Name  Age        City  Salary
0    A   32      London    6000
1    B   22     Bristol    5000
2    C   43    New York    4500
3    D   24  Manchester    6500

In [ ]:
## Remove a column
df.drop('Salary',axis=1,inplace=True)

In [46]:
df

  Name  Age        City
0    A   32      London
1    B   22     Bristol
2    C   43    New York
3    D   24  Manchester

In [47]:
## Add age to the column
df["Age"]=df["Age"]+1
df

  Name  Age        City
0    A   33      London
1    B   23     Bristol
2    C   44    New York
3    D   25  Manchester

In [50]:
df.drop(0,inplace=True)

In [51]:
df

  Name  Age        City
1    B   23     Bristol
2    C   44    New York
3    D   25  Manchester

In [53]:
df.head(5)

  Order ID  Order Date CustomerName           State     City
0  B-26055  10-03-2018    Harivansh   Uttar Pradesh  Mathura
1  B-25993  03-02-2018       Madhav           Delhi    Delhi
2  B-25973  24-01-2018  Madan Mohan   Uttar Pradesh  Mathura
3  B-25923  27-12-2018        Gopal     Maharashtra   Mumbai
4  B-25757  21-08-2018     Vishakha  Madhya Pradesh   Indore

In [57]:
# Display the data types of each column
print("Data types:\n", df.dtypes)

#Describe the DataFrame
print("Statistical Summary:\n",df.describe())

Data types:
 Order ID        object
Order Date      object
CustomerName    object
State           object
City            object
dtype: object
Statistical Summary:
        Order ID  Order Date CustomerName        State    City
count       500         500          500          500     500
unique      500         307          336           19      25
top     B-26095  24-11-2018       Shreya  Maharashtra  Indore
freq          1           7            6           94      71

In [56]:
df.describe()

       Order ID  Order Date CustomerName        State    City
count       500         500          500          500     500
unique      500         307          336           19      25
top     B-26095  24-11-2018       Shreya  Maharashtra  Indore
freq          1           7            6           94      71